{
  "auto_mapping": {
    "base_model_class": "Qwen2ForCausalLM",
    "parent_library": "transformers.models.qwen2.modeling_qwen2"
  },
  "base_model_name_or_path": "/data2/mengfanxu/huggingface/Qwen2.5-0.5B",
  "bias": "none",
  "exclude_modules": null,
  "head_dim": 64,
  "head_in_or_head_out": {
    "q_proj": "in",
    "v_proj": "out"
  },
  "inference_mode": true,
  "init_clover_weights": "qr",
  "modules_to_save": null,
  "peft_type": "CLOVER",
  "revision": null,
  "target_modules": [
    "v_proj",
    "q_proj"
  ],
  "task_type": null
}